/*==============================================================================

[TitleScene.cpp]
														Author :Watanabe Retsu
														Date   :2026/07/01
--------------------------------------------------------------------------------

==============================================================================*/

//==============================================================================
//インクルード
//==============================================================================
#include "main.h"
#include "Manager.h"
#include "Input.h"
#include "Polygon2D.h"
#include "TitleScene.h"
#include "GameScene.h"
//==============================================================================
//マクロ宣言
//==============================================================================
#define LogoWidth 600.0f
#define LogoHeight 400.0f
//==============================================================================
//プロトタイプ宣言
//==============================================================================

//==============================================================================
//グローバル変数
//==============================================================================

//==============================================================================
//初期化処理
//==============================================================================
void TitleScene::Init()
{
	//背景
	Manager::AddGameObject<Polygon2D>()->Init(0.0f, 0.0f, SCREEN_WIDTH, SCREEN_HEIGHT, L"asset\\texture\\DemoTitleBG.png");

	//タイトルロゴ
	float LogoX = (SCREEN_WIDTH - LogoWidth) * 0.5f ;
	float LogoY = (SCREEN_HEIGHT - LogoHeight) * 0.1f ;
	m_Logo = Manager::AddGameObject<Polygon2D>();
	m_Logo->Init(LogoX, LogoY, LogoWidth, LogoHeight,L"asset\\texture\\DemoTitleLogo.png");

	//スタートボタン
	float StartX = (SCREEN_WIDTH - LogoWidth) * 0.5f;
	float StartY = (SCREEN_HEIGHT - LogoHeight) * 1.1f;
	m_startButton = Manager::AddGameObject<Polygon2D>();
	m_startButton->Init(StartX, StartY, LogoWidth, LogoHeight, L"asset\\texture\\DemoTitleStart.png");

}

//==============================================================================
//終了処理
//==============================================================================
void TitleScene::Uninit()
{

}

//==============================================================================
//更新処理
//==============================================================================
void TitleScene::Update()
{

	if (Input::GetKeyTrigger(VK_RETURN) || Input::GetMouseTrigger(Input::MOUSE_LEFT))
	{
		Manager::ChangeScene<GameScene>();
	}

}

//==============================================================================
//描画処理
//==============================================================================
void TitleScene::Draw()
{

}